#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_role.ec2_role: Refreshing state... [id=app-4-ec2_role]
aws_vpc.this: Refreshing state... [id=vpc-0aee610d9ee2f5056]
data.aws_availability_zones.available: Reading...
aws_kms_key.encrytion_secret: Refreshing state... [id=49c814dd-0c0f-4e8d-8dc1-4e4b5f688166]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=app-4-ec2_profile]
aws_iam_role_policy_attachment.custom: Refreshing state... [id=app-4-ec2_role-20231026003922936500000001]
aws_kms_key.encrytion_rest: Refreshing state... [id=d25d563f-9511-4831-9aee-0823f480e665]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
aws_secretsmanager_secret.elasticache_auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD]
aws_secretsmanager_secret_version.auth: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:743794601996:secret:elasticache_auth-m2r3iD|8928B07B-E518-404C-91FB-015779DEFB0D]
aws_route_table.public: Refreshing state... [id=rtb-07a879baced138b59]
aws_default_security_group.default: Refreshing state... [id=sg-017656e5a4e187b27]
aws_security_group.elasticache: Refreshing state... [id=sg-0ed1869e3d212ceff]
aws_subnet.private[2]: Refreshing state... [id=subnet-052cb9788e3699e42]
aws_subnet.private[0]: Refreshing state... [id=subnet-0d793fee34548d46b]
aws_route_table.private[0]: Refreshing state... [id=rtb-00fd94662b273fa5f]
aws_route_table.private[2]: Refreshing state... [id=rtb-0be19402a8902cddc]
aws_subnet.private[1]: Refreshing state... [id=subnet-00445199ef90108e3]
aws_subnet.public[0]: Refreshing state... [id=subnet-01504aaf919b844a2]
aws_route_table.private[1]: Refreshing state... [id=rtb-09c463d4787f20931]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-049a33ab4984be2a1]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-07474438f8d7717f5]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a3cfb9c7b6d62162]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ec28b2c44b0623b5]
aws_elasticache_subnet_group.elasticache_subnet: Refreshing state... [id=cache-subnet]
aws_elasticache_replication_group.app4: Refreshing state... [id=app-4-redis-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_profile will be destroyed
  # (because aws_iam_instance_profile.ec2_profile is not in configuration)
  - resource "aws_iam_instance_profile" "ec2_profile" {
      - arn         = "arn:aws:iam::743794601996:instance-profile/app-4-ec2_profile" -> null
      - create_date = "2023-10-26T00:39:23Z" -> null
      - id          = "app-4-ec2_profile" -> null
      - name        = "app-4-ec2_profile" -> null
      - path        = "/" -> null
      - role        = "app-4-ec2_role" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        } -> null
      - unique_id   = "AIPA22LM46AGH4Y5DRJLB" -> null
    }

  # aws_iam_policy.ssm_parameter_policy will be created
  + resource "aws_iam_policy" "ssm_parameter_policy" {
      + arn         = (known after apply)
      + description = "Policy to read from SSM Parameter Store"
      + id          = (known after apply)
      + name        = "ssm_parameter_policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
    }

  # aws_iam_role.ec2_role will be destroyed
  # (because aws_iam_role.ec2_role is not in configuration)
  - resource "aws_iam_role" "ec2_role" {
      - arn                   = "arn:aws:iam::743794601996:role/app-4-ec2_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-10-26T00:39:22Z" -> null
      - force_detach_policies = false -> null
      - id                    = "app-4-ec2_role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "app-4-ec2_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        } -> null
      - unique_id             = "AROA22LM46AGLVYTTM2WD" -> null
    }

  # aws_iam_role_policy_attachment.custom will be destroyed
  # (because aws_iam_role_policy_attachment.custom is not in configuration)
  - resource "aws_iam_role_policy_attachment" "custom" {
      - id         = "app-4-ec2_role-20231026003922936500000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore" -> null
      - role       = "app-4-ec2_role" -> null
    }

  # aws_ssm_parameter.elasticache_ep will be created
  + resource "aws_ssm_parameter" "elasticache_ep" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "d25d563f-9511-4831-9aee-0823f480e665"
      + name           = "/elasticache/app-4-redis-cluster/endpoint"
      + tags_all       = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.elasticache_port will be created
  + resource "aws_ssm_parameter" "elasticache_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "d25d563f-9511-4831-9aee-0823f480e665"
      + name           = "/elasticache/app-4-redis-cluster/port"
      + tags_all       = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*